app/controllers/welcome_controller.rb

INSERT INTO "transtornos_pesquisados" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-04-01 22:02:25.241279"], ["updated_at", "2017-04-01 22:02:25.241279"]]
---
      if @@pesquisaTranstorno != []#verifica se tem pesquisa feita
        #TranstornosPesquisado (só dar um new sempre e associar)
        t = TranstornosPesquisado.new
        t.save

INSERT INTO "transtornos_nao_solucionados" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-04-01 22:56:36.104951"], ["updated_at", "2017-04-01 22:56:36.104951"]]
INSERT INTO "transtorno_nao_solucionado_sintomas" ("transtornos_nao_solucionado_id", "sintoma_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["transtornos_nao_solucionado_id", 3], ["sintoma_id", 3], ["created_at", "2017-04-01 23:01:30.372335"], ["updated_at", "2017-04-01 23:01:30.372335"]]
---
      #Se @@pesquisaTranstorno n tem algo, salvar a consulta na tabela de não resolvidos
      else
        t = TranstornosNaoSolucionado.new
        t.save
        sintomasPesquisados.each do |sP|
          sP.each do |x|
            s = Sintoma.find(x.sintoma_id)
            s.transtorno_nao_solucionado_sintoma.create(transtornos_nao_solucionado: t)