app/controllers/welcome_controller.rb

  def index
    @SintomasCad = Sintoma.order :nome
---
SELECT "sintomas".* FROM "sintomas"  ORDER BY "sintomas"."nome" ASC

  def create
    sintomasPesquisados = []
    @@pesquisaDoenca = []
    @@pesquisaSintoma = []
    @@sintomasPesquisadosOrganizado = []

    #valida pesquisa nula
    if params[:id].nil?
      redirect_to '/search'
    else
      #pesquisa relações id_sintomas
      params[:id].each do |id_parm|
        #to_a para tirar ActiveRecord::Relation
        sintomasPesquisados << SintomasDoenca.where(sintoma_id: id_parm).to_a
      end

      sintomasPesquisados.each do |s|
        s.each do |f|
          #Pesquisa doenças com esses sintomas
          #varrendo o array para achar a doença pelo id
          @@pesquisaDoenca << Doenca.find(f.doenca_id)
          #manipula sintomasPesquisados para deixar só o id dos sintomas em um array simples
          @@sintomasPesquisadosOrganizado << f.sintoma_id
        end
      end

      #Deleta doenças iguais encontradas
      @@pesquisaDoenca.each do |s|
        if @@pesquisaDoenca.select {|e| e.id == s.id}.count > 1
          aux = @@pesquisaDoenca.select {|e| e.id == s.id}#pega todos duplicados
          aux.delete_at(aux.index(aux.first))#tira 1 do array
---
SELECT  "sintomas_doencas".* FROM "sintomas_doencas" WHERE "sintomas_doencas"."sintoma_id" = $1  ORDER BY "sintomas_doencas"."id" ASC LIMIT 1  [["sintoma_id", 6]]
SELECT "doencas".* FROM "doencas" INNER JOIN "sintomas_doencas" ON "sintomas_doencas"."doenca_id" = "doencas"."id" INNER JOIN "sintomas" ON "sintomas"."id" = "sintomas_doencas"."sintoma_id" WHERE (sintoma.id = @sintomaP.id)
DELETE FROM "doencas" WHERE "doencas"."id" = $1  [["id", 4]]

      @@pesquisaDoenca.each do |s|
          auxArray = []
          auxArray2 = []
          auxArray << SintomasDoenca.where(doenca_id: s.id).to_a#procura Doença
          auxArray.each do |j|
            j.each do |y|
              auxArray2 << Sintoma.find(y.sintoma_id)#procura sintomas da Doença
---
SELECT "sintomas_doencas".* FROM "sintomas_doencas" WHERE "sintomas_doencas"."doenca_id" = $1  [["doenca_id", 2]]
SELECT  "sintomas".* FROM "sintomas" WHERE "sintomas"."id" = $1 LIMIT 1  [["id", 3]]